--- a/README.md
+++ b/README.md
@@ -1,320 +1,104 @@
-
-# Arquitectura
-
-```
-                    IOC Platform
-
-        +------------------------------+
-        |         Frontend             |
-        +--------------+---------------+
-                       |
-                       v
-                FastAPI REST API
-                       |
-      +----------------+----------------+
-      |                                 |
-      v                                 v
-   Services                      Collector
-      |                                 |
-      v                                 v
-Repositories                  VirusTotal API
-      |
-      v
- PostgreSQL
+```mermaid
+flowchart LR
+Browser-->Nginx
+Nginx-->FastAPI
+FastAPI-->Services
+Services-->Repositories
+Repositories-->SQLAlchemy
+SQLAlchemy-->PostgreSQL
+FastAPI-->VirusTotal
+FastAPI-->Splunk
+FastAPI-->TheHive
+FastAPI-->Cortex
 ```
 
----
+## Tecnologías
